# Pandas

In [1]:
import numpy as np
import pandas as pd

## Creating a Series

You can convert a list, numpy array, or dictionary to a Series

### Using List

In [9]:
labels = ['a','b','c']

li = [10, 20, 30]

In [10]:
pd.Series(data=li)

0    10
1    20
2    30
dtype: int64

In [11]:
pd.Series(data=li, index=labels)

a    10
b    20
c    30
dtype: int64

In [12]:
pd.Series(li, labels)

a    10
b    20
c    30
dtype: int64

### Using Numpy Array

In [13]:
n_array = np.array([10,20,30])

In [15]:
pd.Series(n_array)

0    10
1    20
2    30
dtype: int32

In [16]:
pd.Series(n_array, labels)

a    10
b    20
c    30
dtype: int32

### Using Dictionary

In [18]:
d = {'a':10,'b':20,'c':30, 'd': 30}

print(d['b'])

pd.Series(d)

20

a    10
b    20
c    30
d    30
dtype: int64

## Index

Pandas makes use of index names or numbers by allowing for fast look ups of information.

In [19]:
series_1 = pd.Series([1, 2, 3, 4], index = ['CSE', 'ECE', 'FET', 'CE'])

In [20]:
series_2 = pd.Series([1, 2, 5, 4], index = ['CSE', 'FET','CE', 'IE'])

In [22]:
# to get particular index

series_1['CSE']

1

In [24]:
# can do operations too
series_1 + series_2

CE     9.0
CSE    2.0
ECE    NaN
FET    5.0
IE     NaN
dtype: float64

## Creating a DataFrame

In [25]:
from numpy.random import randn
np.random.seed(101)

In [26]:
a = 'ab.cd'

print(a.split('.'))

['ab', 'cd']

In [32]:
df = pd.DataFrame(randn(5,4), index=['A', 'B', 'C', 'D', 'E'], columns='W X Y Z'.split())

In [33]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

### Indexing

In [34]:
df['W']

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [35]:
# Pass a list of column names
df[['W','Z', 'Y']]

          W         Z         Y
A  2.706850  0.503826  0.907969
B  0.651118  0.605965 -0.848077
C -2.018168 -0.589001  0.528813
D  0.188695  0.955057 -0.933237
E  0.190794  0.683509  2.605967

In [36]:
type(df['W'])

pandas.core.series.Series

**Creating a new column:**

In [37]:
df['A'] = df['W'] + df['Y']

In [38]:
df

          W         X         Y         Z         A
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

**Removing Columns**

In [40]:
df.drop('A', axis=1)

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [41]:
# Not inplace. We need to specify it
df

          W         X         Y         Z         A
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [43]:
# drop column
df.drop('A', axis=1, inplace=True)

In [44]:
# drop row
df.drop('E', axis=0)

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

### Selection

In [45]:
df.loc['A']

W    2.706850
X    0.628133
Y    0.907969
Z    0.503826
Name: A, dtype: float64

In [46]:
# selection based on the index number

df.iloc[2]

W   -2.018168
X    0.740122
Y    0.528813
Z   -0.589001
Name: C, dtype: float64

In [48]:
# selecting subset of row and column
df.loc['B','Y']

-0.8480769834036315

In [49]:
df.loc[['A','B'],['W','Y']]

          W         Y
A  2.706850  0.907969
B  0.651118 -0.848077

### Conditional Selection

In [50]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [51]:
df[df>0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

## Handling empty data

In [53]:
# NAN -> Not a Number
x = np.nan

print(x)

nan

In [54]:
df = pd.DataFrame(
            {
                'A':[1, 2, np.nan],
                'B':[5, np.nan, np.nan],
                'C':[1, 2, 3]
            }
)

In [55]:
# drops NAN values
df.dropna()

     A    B  C
0  1.0  5.0  1

In [56]:
# drops NAN values from Column end
df.dropna(axis = 1)

   C
0  1
1  2
2  3

In [58]:
# fills NAN values with user defined values
df.fillna(value='10')

     A    B  C
0  1.0  5.0  1
1  2.0   10  2
2   10   10  3

In [59]:
# finding the sum
df['A'].sum()

3.0

In [60]:
# finding mean
df['A'].mean()

1.5

In [62]:
# filling NAN values with mean value of C column
df['A'].fillna(value = df['C'].mean())

0    1.0
1    2.0
2    2.0
Name: A, dtype: float64

In [65]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  2.0  NaN  3

In [63]:
# to change it in the original variable 
# we need to assign it back to the dataframe

df['A'] = df['A'].fillna(value=df['C'].mean())

In [64]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  2.0  NaN  3

## Concat

In [66]:
df1 = pd.DataFrame(
    {
        'A': ['A0', 'A1', 'A2', 'A3'],
        'B': ['B0', 'B1', 'B2', 'B3'],
        'C': ['C0', 'C1', 'C2', 'C3'],
        'D': ['D0', 'D1', 'D2', 'D3']
    },
    index=[0, 1, 2, 3]
)

In [67]:
df2 = pd.DataFrame(
    {
        'A': ['A4', 'A5', 'A6', 'A7'],
        'B': ['B4', 'B5', 'B6', 'B7'],
        'C': ['C4', 'C5', 'C6', 'C7'],
        'D': ['D4', 'D5', 'D6', 'D7']
    },
    index=[4, 5, 6, 7]
)

In [68]:
df3 = pd.DataFrame(
    {
        'A': ['A8', 'A9', 'A10', 'A11'],
        'B': ['B8', 'B9', 'B10', 'B11'],
        'C': ['C8', 'C9', 'C10', 'C11'],
        'D': ['D8', 'D9', 'D10', 'D11']
    },
    index=[8, 9, 10, 11]
)

In [70]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [71]:
df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [72]:
df3

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [76]:
df4 = pd.concat([df1,df2,df3])

df4

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [77]:
df5 = pd.concat([df2, df1])

df5

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

## Merging

In [78]:
left = pd.DataFrame(
    {
        'key': ['K0', 'K1', 'K2', 'K3'],
        'A': ['A0', 'A1', 'A2', 'A3'],
        'B': ['B0', 'B1', 'B2', 'B3']
    }
)
   
right = pd.DataFrame(
    {
        'key': ['K0', 'K1', 'K2', 'K3'],
        'C': ['C0', 'C1', 'C2', 'C3'],
        'D': ['D0', 'D1', 'D2', 'D3']
    }
)

In [79]:
m_df = pd.merge(left, right, on='key')

In [80]:
m_df

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

## Joining

In [81]:
left = pd.DataFrame(
    {
        'A': ['A0', 'A1', 'A2'],
        'B': ['B0', 'B1', 'B2']
    },
        index=['K0', 'K1', 'K2']
) 

right = pd.DataFrame(
    {
        'C': ['C0', 'C2', 'C3'],
        'D': ['D0', 'D2', 'D3']
    },
    index=['K0', 'K2', 'K3']
)

In [83]:
left.join(right)

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2

In [82]:
left.join(right, how='left')

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2

In [85]:
left.join(right, how='outer')

      A    B    C    D
K0   A0   B0   C0   D0
K1   A1   B1  NaN  NaN
K2   A2   B2   C2   D2
K3  NaN  NaN   C3   D3

In [86]:
left.join(right, how='inner')

     A   B   C   D
K0  A0  B0  C0  D0
K2  A2  B2  C2  D2